WARRIOR = {
    "Тип": "Воин",
    "Здоровье": 10,
    "Атака": 10,
    "Уровень": 1,
    "Защита": 10,
    "Инвентарь": ['Карта,', 'зелье здоровья,', 'соль'],
    "Мана": 10,
    "Опыт": 0,
    "Деньги": 1000,
    "Способность": 'Землетряс',
}

ARCHER = {
    "Тип": "Лучник",
    "Здоровье": 100,
    "Атака": 50,
    "Уровень": 1,
    "Защита": 3,
    "Инвентарь": ['Карта,', 'зелье здоровья,', 'соль'],
    "Мана": 30,
    "Опыт": 0,
    "Деньги": 0,
    "Способность": 'Землетряс',
}

WIZARD = {
    "Тип": "Маг",
    "Здоровье": 110,
    "Атака": 30,
    "Уровень": 1,
    "Защита": 0,
    "Инвентарь": ['Карта,', 'зелье здоровья,', 'соль'],
    "Мана": 50,
    "Опыт": 0,
    "Деньги": 0,
    "Способность": 'Землетряс',
}